sriharshaq/LPC1768-FreeRTOS-SIM900/app/main.c

#include "stdint.h"
#include "stdlib.h"
#include "uart.h"
#include "misc.h"
#include "lcd.h"
#include "delay.h"
#include "gsm.h"
#include "system_LPC17xx.h"
#include "LPC17xx.h"
#include "stdio.h"
#include "syscalls.h"
#include "string.h"
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "config.h"
#include "app.h"

/* streams (stdout, stdin, stderr) */
FILE * stdin;
FILE * stdout;
FILE * stderr;

extern uint8_t system_boot(void);

/* task handles */
xTaskHandle 		connectionTaskHandle;
xTaskHandle 		displayTaskHandle;
xTaskHandle 		zigbeeTaskHandle;
xTaskHandle 		httpTaskHandle;

/* semaphores */
xSemaphoreHandle 	lcdFlag;
xSemaphoreHandle	modemFlag;
xSemaphoreHandle	zigbeeFlag;

/* Queues */
xQueueHandle lcdQueue;
xQueueHandle xbeeQueue;

device * _device;

int main(void)
{
	if(system_boot())
	{

		/* create semaphores */
		lcdFlag 	= xSemaphoreCreateMutex();
		modemFlag 	= xSemaphoreCreateMutex();
		zigbeeFlag	= xSemaphoreCreateMutex();

		xTaskCreate(process_connection , 
					( signed char * ) "connection", 
					configMINIMAL_STACK_SIZE, 
					( void * ) NULL, 
					tskIDLE_PRIORITY, 
					&connectionTaskHandle );

		xTaskCreate(process_display , 
					( signed char * ) "display", 
					configMINIMAL_STACK_SIZE, 
					( void * ) NULL, 
					tskIDLE_PRIORITY, 
					&displayTaskHandle );

		xTaskCreate(process_zigbee , 
					( signed char * ) "zigbee", 
					configMINIMAL_STACK_SIZE, 
					( void * ) NULL, 
					tskIDLE_PRIORITY, 
					&zigbeeTaskHandle );

		lcdQueue  = xQueueCreate(10, sizeof(_device));
		xbeeQueue = xQueueCreate(10, sizeof(_device));

		/* start the scheduler */
		vTaskStartScheduler();	
		
		/* we never reach here */
		return 0;	
	}

	lcd_set_xy(0,0);
	lcd_print("going idle",1);
	for(;;){
		;
	}
	/* we never reach here */
	return 0;
}




